#### FabricationItemFile Members

---

|  |
| --- |
| FabricationItemFile Class   Methods   Properties   See Also |

The  FabricationItemFile  type exposes the following members.

# Methods

|  | Name | Description |
| --- | --- | --- |
| Public method | Dispose | Releases all resources used by the  FabricationItemFile |
| Public method | Equals | Determines whether the specified  Object  is equal to the current  Object  . (Inherited from  Object  .) |
| Public method | GetHashCode | Serves as a hash function for a particular type. (Inherited from  Object  .) |
| Public method | GetImage | Gets the image for the fabrication item file. |
| Public method | GetType | Gets the  Type  of the current instance. (Inherited from  Object  .) |
| Public method | IsLoaded | Checks to see if the item file has been loaded into the configuration. |
| Public method | IsValid | Checks to see if the item file is valid. |
| Public method | ToString | Returns a string that represents the current object. (Inherited from  Object  .) |

# Properties

|  | Name | Description |
| --- | --- | --- |
| Public property | Identifier | The string identifier for the item file. This string is unique and can be used to compare whether fabrication item files are the same file. |
| Public property | IsUsed | Checks to see if the item file is already in use in the project. |
| Public property | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |

# See Also

FabricationItemFile Class

Autodesk.Revit.DB Namespace